/*
此脚本致力于将后端数据，变为elementUI级联选择器所需的数据格式
 */
//这里是后端同学传的数据
let data = [
    {id: 2, pid: 0, label: "指南"},
    {id: 3, pid: 0, label: "导航"},
    {id: 4, pid: 2, label: "设计原则"},
    {id: 5, pid: 3, label: "侧向导航"},
    {id: 6, pid: 7, label: "Basic"},
    {id: 7, pid: 0, label: "组件"},
    {id: 8, pid: 4, label: "一致"},
    {id: 9, pid: 4, label: "反馈"},
    {id: 10, pid: 4, label: "效率"},
    {id: 11, pid: 4, label: "可控"},
    {id: 12, pid: 6, label: "Form"},
];

let sn_data = [
    {
        "id": 50101,
        "name": "国网重庆市电力公司",
        "pid": 0
    },
    {
        "id": 50451,
        "name": "国网重庆市电力公司潼南供电分公司",
        "pid": 50101
    },
    {
        "id": 50431,
        "name": "国网重庆市电力公司黔江供电分公司",
        "pid": 50101
    },
    {
        "id": 50438,
        "name": "国网重庆市电力公司巫溪供电分公司",
        "pid": 50101
    },
    {
        "id": 50435,
        "name": "国网重庆市电力公司云阳供电分公司",
        "pid": 50101
    },
    {
        "id": 50434,
        "name": "国网重庆市电力公司开州供电分公司",
        "pid": 50101
    },
    {
        "id": 50436,
        "name": "国网重庆市电力公司大足供电分公司",
        "pid": 50101
    },
    {
        "id": 50432,
        "name": "国网重庆市电力公司铜梁供电分公司",
        "pid": 50101
    },
    {
        "id": 50430,
        "name": "国网重庆市电力公司丰都供电分公司",
        "pid": 50101
    },
    {
        "id": 50437,
        "name": "国网重庆市电力公司巫山供电分公司",
        "pid": 50101
    },
    {
        "id": 50445,
        "name": "国网重庆市电力公司合川供电分公司",
        "pid": 50101
    },
    {
        "id": 50404,
        "name": "国网重庆市电力公司南岸供电分公司",
        "pid": 50101
    },
    {
        "id": 50402,
        "name": "国网重庆市电力公司市区供电分公司",
        "pid": 50101
    },
    {
        "id": 50410,
        "name": "国网重庆市电力公司万州供电分公司",
        "pid": 50101
    },
    {
        "id": 50406,
        "name": "国网重庆市电力公司綦南供电分公司",
        "pid": 50101
    },
    {
        "id": 50411,
        "name": "国网重庆市电力公司璧山供电分公司",
        "pid": 50101
    },
    {
        "id": 50407,
        "name": "国网重庆市电力公司长寿供电分公司",
        "pid": 50101
    },
    {
        "id": 50405,
        "name": "国网重庆市电力公司北碚供电分公司",
        "pid": 50101
    },
    {
        "id": 50470,
        "name": "重庆两江供电有限公司",
        "pid": 50101
    },
    {
        "id": 50414,
        "name": "电能计量中心",
        "pid": 50101
    },
    {
        "id": 50452,
        "name": "国网重庆市电力公司垫江供电分公司",
        "pid": 50101
    },
    {
        "id": 50447,
        "name": "国网重庆市电力公司南川供电分公司",
        "pid": 50101
    },
    {
        "id": 50433,
        "name": "国网重庆市电力公司忠县供电分公司",
        "pid": 50101
    },
    {
        "id": 50442,
        "name": "国网重庆市电力公司酉阳供电分公司",
        "pid": 50101
    },
    {
        "id": 50443,
        "name": "国网重庆市电力公司彭水供电分公司",
        "pid": 50101
    },
    {
        "id": 50444,
        "name": "国网重庆市电力公司江津区供电分公司",
        "pid": 50101
    },
    {
        "id": 50448,
        "name": "国网重庆市电力公司奉节供电分公司",
        "pid": 50101
    },
    {
        "id": 50408,
        "name": "国网重庆市电力公司永川供电分公司",
        "pid": 50101
    },
    {
        "id": 50412,
        "name": "国网重庆市电力公司江津供电分公司",
        "pid": 50101
    },
    {
        "id": 50409,
        "name": "国网重庆市电力公司江北供电分公司",
        "pid": 50101
    },
    {
        "id": 50439,
        "name": "国网重庆市电力公司城口供电分公司",
        "pid": 50101
    },
    {
        "id": 50440,
        "name": "国网重庆市电力公司石柱供电分公司",
        "pid": 50101
    },
    {
        "id": 50441,
        "name": "国网重庆市电力公司秀山供电分公司",
        "pid": 50101
    },
    {
        "id": 50453,
        "name": "国网重庆市电力公司武隆供电分公司",
        "pid": 50101
    },
    {
        "id": 50454,
        "name": "重庆川东电力集团有限责任公司",
        "pid": 50101
    },
    {
        "id": 50455,
        "name": "重庆涪陵电力实业股份有限公司",
        "pid": 50101
    },
    {
        "id": 50402040101,
        "name": "大溪沟营业厅",
        "pid": 50402
    },
    {
        "id": 50402050101,
        "name": "沙坪坝营业厅",
        "pid": 50402
    },
    {
        "id": 50404030601,
        "name": "鱼洞营业厅",
        "pid": 50404
    },
    {
        "id": 50409040101,
        "name": "新牌坊营业厅",
        "pid": 50409
    },
    {
        "id": 50410020101,
        "name": "一横街营业厅",
        "pid": 50410
    },
    {
        "id": 50411010101,
        "name": "壁城营业厅",
        "pid": 50411
    },
    {
        "id": 50432010201,
        "name": "巴川营业厅",
        "pid": 50432
    },
    {
        "id": 50447030201,
        "name": "南坪营业厅",
        "pid": 50447
    }
]
// 声明变量
let pid = "pid",pId = 0,id = "id",name = "name";
// 创建一个内部函数selector
const selector = (pId, arr) => {
    // 声明一个空数组，用于储存处理后的数据
    const res = [];
    // 这里使用forEach循环
    arr.forEach((i) => {
        // 如果某对象的pid等于传进来的数 这里第一次传进来的pId = 0也就是查找最顶级
        if (i[pid] === pId) {
            // 自己调用自己并传入当前位置的对象的id和整个数组对象
            // 由于查出来的是子级 所以赋值给children
            const children = selector(i[id], sn_data);
            // 原来的数据不符合element要求的格式，所以这里进行重构
            const obj = {
                label: i[name],
                value: i[id],
            };
            // 如果有 children 则插入 obj 中
            if (children.length) {
                obj.children = children;
            }
            // 将obj插入数组最后一位
            res.push(obj);
        }
    });
    // 返回生成的数据
    return res;
};
// 调用函数,传入pId和数组并赋值给selector
let disposeData= selector(pId, sn_data);
// 打印selector查看数据是否符合要求
console.log(disposeData)